import React from "react";
import Container from "@material-ui/core/Container";
import Box from "@material-ui/core/Box";
import { Helmet } from "react-helmet";

function TermsAndPrivacy() {
  return (
    <Container maxWidth="md">
      <Helmet>
        <title>Terms And Privacy</title>
      </Helmet>
      <Box mt={12} mb={6} dir="rtl">
        <h1>Terms of use and privacy policy - OfnoParking</h1>

        <h3>
          תקנון השימוש באתר הנ"ל נכתב בלשון זכר אך האמור בו מתייחס לנשים וגברים
          כאחד.
        </h3>
        <p></p>
        <ol>
          <li>
            <h4>הקדמה</h4>
            <p>
              אתר "אופנו-פרקינג" (להלן "האתר") הוא אתר המשמש כמערכת לאיתור חניית
              דו גלגלי ייצוגי עבור "אופנו-פרקינג" והנך מוזמן לקחת בו חלק בכפוף
              להסכמתך לתנאי השימוש אשר יפורטו להלן
            </p>
            <p>
              בנוסף השימוש באתר זה על כל תכניו והשירותים המוצעים בו, הורדות של
              קבצים, מדיה כגון תמונות וסרטונים והתכנים השונים המוצעים לקהל
              המבקרים עשויים להשתנות מעת לעת או בהתאם לסוג התוכן.
            </p>
            <p>
              הנהלת האתר שומרת לעצמה הזכות לעדכן את תנאי השימוש המוצגים להלן מעת
              לעת וללא התראה או אזכור מיוחד בערוצי האתר השונים.
            </p>
          </li>

          <li>
            <h4>תוכן האתר</h4>
            <p>
              אנו שואפים לספק לכם את המידע המוצג באתר ללא הפרעות אך יתכנו בשל
              שיקולים טכניים, תקלות צד ג או אחרים, הפרעות בזמינות האתר. ולכן
              איננו יכולים להתחייב כי האתר יהיה זמין לכם בכל עת ולא יינתן כל
              פיצוי כספי או אחר בשל הפסקת השירות / הורדת האתר.
            </p>
            <p>
              קישורים לאתר חיצוניים אינם מהווים ערובה כי מדובר באתרים בטוחים,
              איכותיים או אמינים וביקור בהם נעשה על דעתכם האישית בלבד ונמצאים
              בתחום האחריות הבלעדי של המשתמש באתר.
            </p>
            <p>
              התכנים המוצעים באתר (רשימת החנייות, תצוגת המפה, תמונות המוצגות
              באתר) אינם בבעלותו הבלעדית של "אופנו-פרקינג" ואין לעשות בהם שימוש
              אשר נוגד את האמור בתקנון זה, למעט במקרים בהם צוין אחרת או במקרים
              בהם צוין כי זכויות היוצרים שייכים לגוף חיצוני. במקרים אלו יש לבדוק
              מהם תנאי השימוש בקישור המצורף ולפעול על פי המצוין באתר החיצוני לו
              שייכים התכנים. בעלי האתר "אופנו-פארקינג" לא יהיה אחראים לכל נזק
              שהוא, ישיר ו/או עקיף, שנגרם למשתמש ו/או צד שלישי כלשהו בקשר עם
              השימוש במידע ו/או להסתמכות עליו. בעלי האתר אינם נושאים בכל אחריות
              או חבות בגין כל שיבוש, טעות או השמטה בתכני האתר. בנוסף לזאת, בעלי
              האתר אינם מתחייבים לתקינות המידע והקישורים וייתכנו שיבושים וטעויות
              במידע.
            </p>
          </li>
          <li>
            <h4>ניהול משתמשים ומבקרים באתר</h4>
            <p>
              הנהלת האתר שומרת לעצמה את הזכות לחסום כל משתמש ובין אם על ידי
              חסימת כתובת הIP של המחשב שלו, כתובת הMACID של המחשב שלו או אפילו
              בהתאם למדינת המוצא ללא צורך לספק תירוץ אשר מקובל על הגולש.
            </p>
            <p>
              צוות האתר / הנהלת האתר יעשה כל שביכולתו להגן על פרטי המשתמשים
              הרשומים באתר / מנויים הרשומים באתר. במקרים בהם יעלה בידיו של צד
              שלישי להשיג גישה למידע מוסכם בזאת כי לגולשים, משתמשים וחברים באתר
              לה תהה כל תביעה, טענה או דרישה כלפי צוות האתר "אופנו-פרקינג".
            </p>
          </li>
          <li>
            <h4>גילוי נאות</h4>
            <p>
              באתר זה עשוי לעשות שימוש בקבצי קוקיז (במיוחד עבור משתמשים רשומים
              ומנויים) ובממשקי סטטיסטיקה פנימיים בכדי לשמור תיעוד סטטיסטי
              אנונימי של גולשים וניתוח תנועת הגולש/ים, הרגלי גלישה באתר וניתוח
              קליקים וזמן שהייה.
            </p>
            <p>
              בכל העת ולבד מאשר גולשים המחוברים לאתר המידע הנשמר הוא אנונימי
              לחלוטין ואין בו את שם הגולש או כל פרט מזהה אחר.
            </p>
          </li>
          <li>
            <h4>איזור שיפוט</h4>
            <p>
              בעת שאתם עושים שימוש באתר ובמקרה בו התגלעה כל מחולקת אתם מסכימים
              להלן כי האמור לעיל נמצא תחת סמכות השיפוט הבלעדי של החוק הישראלי
              תוך שימוש במערכת בתי המשפט הישראליים בלבד במחוז תל אביב.
            </p>
          </li>
        </ol>
        <p></p>
      </Box>
    </Container>
  );
}
export default TermsAndPrivacy;
